app/views/users/index.html.erb

SELECT "verses".* FROM "verses" WHERE "verses"."user_id" = 1
SELECT "verse_completions".* FROM "verse_completions" WHERE "verse_completions"."user_id" = 1
SELECT COUNT(*) FROM "verse_completions" WHERE "verse_completions"."user_id" = 1
---
	You have an Average WPM of <%= current_user.wpm %>. <br>
	You have mastered <%= pluralize(current_user.mastered_verses.count, "verse") %> <br>
	You have <%= pluralize(current_user.verse_completions.count, "successful verse completion") %><br><br>