app/controllers/verses_controller.rb

  def create
	@verse = Verse.new(params[:verse])
	if @verse.save
---
INSERT INTO "verses" ("content", "created_at", "ref", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)

  def type
  	@verse = Verse.find(params[:id])
---
SELECT "verses".* FROM "verses" WHERE "verses"."id" = ? LIMIT 1  [["id", "1"]]

  def master
    @verse = Verse.find(params[:id])
---
SELECT "verses".* FROM "verses" WHERE "verses"."id" = ? LIMIT 1  [["id", "0000000001"]]