app/controllers/verse_completions_controller.rb

INSERT INTO "verse_completions" ("created_at", "updated_at", "user_id", "verse_id", "wpm") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 11 Jun 2013 23:52:27 UTC +00:00], ["updated_at", Tue, 11 Jun 2013 23:52:27 UTC +00:00], ["user_id", nil], ["verse_id", nil], ["wpm", nil]]
---
	def create
		@vc = VerseCompletion.new(params["verse_completion"])
		if @vc.save